/*************************************************************************
	> File Name: 25.c
	> Author: 
	> Mail: 
	> Created Time: 2019年11月27日 星期三 20时40分17秒
 ************************************************************************/

#include<stdio.h>
int main()
{
    int n,i,j;
    scanf("%d",&n);
    for(i = 2;i <= n;i ++)
    {
        int f = 1;
        for(j = 2;j < i;j ++)
        {
            if(i % j == 0)
            {
                f = 0;
            }
        }
        if(f){
        printf("%d\n",i);
             }

    }
}

