/*************************************************************************
	> File Name: 30.c
	> Author: 
	> Mail: 
	> Created Time: 2019年11月28日 星期四 13时46分06秒
 ************************************************************************/

#include<stdio.h>
int main()
{
    int n,a =0;
    scanf("%d", &n);
    for(int i = 2; i < n; i ++)
    {
        if(n % i == 0)
        {
            a++;
        }
    }
    if(a == 0)
    {
        printf("YES");
    }
    else
    {
        printf("NO");
    }
}
